Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/health/women_s_health/maternity_and_infant_welfare_services.html.txt.tmx
Source language: en
Languages: ga

source: Maternity and infant care services
ga: Seirbhísí máithreachais agus leasa naíonán

source: The Maternity and Infant Care Scheme provides an agreed programme of care to all expectant mothers who are ordinarily resident in Ireland
ga: Cuireann an Scéim Chúraim Máithreachais agus Naíonán clár socraithe cúraim ar fáil do gach bean atá ag iompar clainne agus a bhíonn ina gnáthchónaí in Éirinn

source: This service is provided by a family doctor (GP) of your choice and a hospital obstetrician
ga: Cuirtear an tseirbhís seo ar fáil ag do rogha gnáthdhochtúir agus cnáimhseoir ospidéil

source: You are entitled to this service even if you do not have a medical card or GP visit card
ga: Tá tú i dteideal an tseirbhís seo a fháil fiú muna bhfuil cárta leighis agat

source: Virtually all GPs have agreements with the Health Service Executive (HSE) to provide these services; they do not have to be part of the medical card scheme
ga: Tá comhaontú ag an gcuid is mó LG le Feidhmeannacht na Seirbhíse Sláinte na seirbhísí seo a sholáthar; ní gá dóibh a bheith mar chuid den chóras LG agus cártaí leighis

source: The Maternity and Infant Care Scheme also provides for two post-natal visits to the GP
ga: Soláthraíonn an Scéim do dhá chuairt iar-bheireatais chuig an ghnáthdhochtúir freisin

source: The combined medical services are provided by your family doctor (GP) and a hospital obstetrician
ga: Cuireann do rogha dochtúra agus cnáimhseoir ospidéil an cóir leighis seo ar fáil

source: On your first pregnancy, the GP provides an initial examination, if possible before 12 weeks, and a further 5 examinations during the pregnancy, which are alternated with visits to the maternity unit/hospital
ga: Le linn do chéid toirchis, soláthraíonn an LG scrúdú tosaigh, más féidir, roimh 12 sheachtain, agus tugtar faoi 5 scrúdú bhreise i gcaitheamh an toirchis, a mbíonn cuairteanna a thabhairt ar an aonad máithreachais/ospidéal i gceist le cuid díobh

source: The schedule of visits may be changed by your GP and/or hospital obstetrician, depending on your individual situation
ga: Féadfaidh to LG agus/nó d’obstatraí ospidéil an sceideal cuairteanna a athrú, ag brath ar do chás féin aonair

source: For subsequent pregnancies you will have an initial examination and a further 6 examinations
ga: I gcás toircheas ina dhiaidh sin, déanfar scrúdú tosaigh ort agus 6 scrúdú bhreise ina dhiaidh sin

source: If you have a significant illness, for example, diabetes or hypertension, you may have up to 5 additional visits to the GP
ga: Má bhíonn tinneas nach beag ar an mbean mar shampla, diabaetas nó brú fola ard, d'fhéadfadh suas le 5 chuairt breise ar an LG a bheith curtha ar fáil

source: After the birth, the GP will examine the baby at 2 weeks and both mother and baby at 6 weeks
ga: Tar éis na breithe déanfaidh an LG scrúdú ar an leanbh ag coicís agus ar an máthair agus ar an leanbh ag 6 seachtain

source: The mother is entitled to free in-patient, out-patient and accident and emergency/casualty services in public hospitals in respect of the pregnancy and the birth and is not liable for hospital charges
ga: Tá an mháthair i dteideal seirbhísí saor in aisce othair chónaithigh, othair sheachtraigh agus timpistí agus éigeandála/taismí a fháil in ospidéil phoiblí maidir leis an toircheas agus leis an mbreith agus níl sí faoi dhliteanas íoc as aon chinn de mhuirir an ospidéil

source: Care for other illnesses which you may have at this time, but which are not related to your pregnancy is not covered by the Scheme
ga: Ní chuimsítear cúram do thinnis eile a d’fhéadfadh bheith ort ag an tráth seo, ach nach mbaineann le do thoircheas faoin Scéim seo

source: However, if you opt to be a private patient of your consultant, you will be liable for the full range of in-patient charges
ga: Áfach, má roghnaíonn tú bheith i d’othar príobháideach de chuid do chomhairligh, beidh tú faoi dhliteanas íoc as an réimse iomlán de mhuirir othair chónaithigh

source: The public health nurse visits the mother and baby at home free of charge, usually within 72 hours of returning home from hospital
ga: Tar éis na breithe, tabharfaidh an t-altra sláinte poiblí cuairt ort agus ar do leanbh sa bhaile, go hiondúil taobh istigh de 72 uair an chloig ón am a scaoiltear amach as an ospidéal tú

source: The GP who attends the mother also provides care for the new-born baby
ga: Cuireann an LG a raibh an mháthair ag freastal air/uirthi cúram ar fáil don leanbh nua freisin

source: They will provide two developmental examinations free of charge at 2 weeks and 6 weeks following the birth
ga: Bíonn dhá scrúdú forbartha i gceist sa chéad 6 seachtain tar éis na breithe atá saor in aisce

source: The baby's entitlement to other free GP services depends on whether they have a medical card or GP visit card
ga: Ní bheidh an leanbh i dteideal seirbhísí eile a fháil saor in aisce ón LG muna bhfuil cárta leighis ag an leanbh féin

source: This means that visits to the GP for any conditions related to the baby's health during this six-week period or afterwards are not covered by the scheme unless the baby has a medical card or GP visit card. See below for details of how to apply
ga: Ciallaíonn sé seo go gcaifear íoc as pé cuairt ar an LG, seachas an dá scrúdú forbartha, muna bhfuil cárta leighis ag an leanbh féin, más sa chéad 6 seachtain tar éis na breithe nó níos déanaí a tharlaíonn na cuairteanna

source: If the baby is born in a hospital, it is usual to carry out screening for metabolic disorders (the Guthrie or heel prick test)
ga: Más san ospidéal a saoltar an leanbh go hiondúil déantar scagthástáil do easláinte áirithe (tastáil Guthrie nó an tastáil phrioctha sáile) ann

source: If the baby is born at home, the test may be carried out by the GP or in the out-patients department of a hospital
ga: Más sa bhaile a saoltar an leanbh is féidir leis an LG an tastáil a dhéanamh

source: This test requires parental consent
ga: De rogha air sin, is féidir é a dhéanamh i rannóg na n-othar seachtrach in ospidéal

source: You can find out more about this test on newbornscreening.ie
ga: Ní mór do thuismitheoirí an linbh cead a thabhairt an tastáil seo a dhéanamh

source: Your GP should have application forms for the Maternity and Infant Care Scheme, which you and your GP complete together
ga: Ba cheart go mbeadh na foirmeacha cuí iarratais ar sheirbhísí faoin Scéim um Chúram Máithreachais agus Naíonán ag an LG

source: Return the form to your Local Health Office
ga: Seol an fhoirm chuig an Oifig Sláinte Áitiúil

source: If you are not eligible for a medical card you can register your child for a GP visit card for children under 6
ga: Ba cheart duit teagmháil a dhéanamh leis an altra sláinte poiblí ag an ionad áitiúil sláinte le heolas a fháil maidir le ranganna réamhbheireatais atá ar fáil

source: If you have a medical card, you can apply for one for your baby if you are getting Child Benefit for them
ga: Mura bhfuil tú incháilithe do chárta leighis, féadfaidh tú do leanbh a chlárú do chárta cuairte LG do leanaí faoi 6 bliana d’aois
